## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.wordpress_database_errors` |
|        | `aws_cloudwatch_metric_alarm.wordpress_database_errors`      |
| update | `aws_cloudwatch_log_metric_filter.wordpress_errors`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.wordpress_database_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "wordpress_database_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/wordpress"
      + name           = "WordPressDatabaseErrors"
      + pattern        = "[(w1=\"*database error*\")]"

      + metric_transformation {
          + default_value = "0"
          + name          = "WordPressDatabaseErrors"
          + namespace     = "WordPress"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.wordpress_errors will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "wordpress_errors" {
        id             = "WordPressErrors"
        name           = "WordPressErrors"
      ~ pattern        = "[(w1=\"*Failed*\" || w1=\"*failed*\" || w1=\"*Error*\" || w1=\"*error*\" || w1=\"*Fatal*\" || w1=\"*fatal*\") && w1!=\"*AH01276*\" && w1!=\"*AH01630*\" && w1!=\"*AH01797*\" && w1!=\"*action=lostpassword&error*\" && w1!=\"*GET /notification-gc-notify/wp-json/wp/v2/pages*\" && w1!=\"*HTTP/1.1\\\" 404*\"]" -> "[(w1=\"*Failed*\" || w1=\"*failed*\" || w1=\"*Error*\" || w1=\"*error*\" || w1=\"*Fatal*\" || w1=\"*fatal*\") && w1!=\"*AH01276*\" && w1!=\"*AH01630*\" && w1!=\"*AH01797*\" && w1!=\"*action=lostpassword&error*\" && w1!=\"*database error*\" && w1!=\"*GET /notification-gc-notify/wp-json/wp/v2/pages*\" && w1!=\"*HTTP/1.1\\\" 404*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.wordpress_database_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "wordpress_database_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + alarm_description                     = "WordPress database errors detected in a 5 minute period"
      + alarm_name                            = "WordPressDatabaseErrors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WordPressDatabaseErrors"
      + namespace                             = "WordPress"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.wordpress_ecs_warn_error_event"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_response_time_average"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_unhealthy_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_cpu_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_memory_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_aurora_replica_lag"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_database_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_failed_login"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_suspicious_login"]
WARN - plan.json - main...
```

</details>
